{
  "image": "/sport.jpg",
  "tag": "Sports",
  "headline": "Regional sports fair to be held in Ratia",
  "time": "4 days ago",
  "description": "A regional sports fair will be organized in Ratia next month, with athletes from various districts of Haryana participating.",
  "by": "Gurcharan Singh",
  "uploaded_Time": "Jun 7, 2025 11:45 am IST",
  "img_cap": "Sports equipment and athletes",
  "content": "Ratia is set to host a major regional sports fair next month, bringing together athletes from various districts of Haryana for a week-long celebration of sports and athleticism. This event, organized by the Haryana Sports Department in collaboration with the local administration, aims to promote sports culture and identify young talent from rural areas.\n\nThe sports fair will feature competitions in multiple disciplines including athletics, kabaddi, wrestling, boxing, and traditional rural sports. Over 500 athletes from 15 districts are expected to participate in this grand event, making it one of the largest sports gatherings in the region.\n\nAccording to the organizing committee, the event will be held at the newly constructed sports complex in Ratia, which has been equipped with modern facilities for various sports. The complex includes a running track, wrestling arena, boxing ring, and facilities for indoor games.\n\nApart from competitive events, the fair will also include sports exhibitions, fitness demonstrations, and workshops for young athletes. Renowned sports personalities from Haryana have been invited to interact with participants and share their experiences.\n\nThe event is expected to boost tourism in Ratia and provide economic benefits to local businesses. Hotels and restaurants in the area are preparing for the influx of visitors, and local artisans are planning to set up stalls showcasing traditional crafts and local cuisine.\n\nRegistration for the sports fair has already begun, and interested athletes can register through their respective district sports offices. The organizing committee has assured that all necessary arrangements for accommodation, food, and medical facilities will be made for the participants.\n\nThis initiative reflects the government's commitment to promoting sports at the grassroots level and providing opportunities for rural youth to showcase their talent on a larger platform."
} 